04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/hotWire/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [mm];

vertices
(
    (-120 0 -60) (-120 -60 0) (-120 0 60) (-120 60 0)
    (-120 0 -30) (-120 -30 0) (-120 0 30) (-120 30 0)

    ( -40 0 -60) ( -40 -60 0) ( -40 0 60) ( -40 60 0)
    ( -40 0 -30) ( -40 -30 0) ( -40 0 30) ( -40 30 0)

    (  40 0 -28) (  40 -28 0) (  40 0 28) (  40 28 0)
    (  40 0 -16) (  40 -16 0) (  40 0 16) (  40 16 0)

    ( 120 0 -28) ( 120 -28 0) ( 120 0 28) ( 120 28 0)
    ( 120 0 -16) ( 120 -16 0) ( 120 0 16) ( 120 16 0)
);

blocks
(
    hex ( 0  4  5  1  8 12 13  9) ( 8 12 16) simpleGrading (1 1 1)
    hex ( 1  5  6  2  9 13 14 10) ( 8 12 16) simpleGrading (1 1 1)
    hex ( 2  6  7  3 10 14 15 11) ( 8 12 16) simpleGrading (1 1 1)
    hex ( 3  7  4  0 11 15 12  8) ( 8 12 16) simpleGrading (1 1 1)

    hex ( 4  7  6  5 12 15 14 13) (12 12 16) simpleGrading (1 1 1)

    hex ( 8 12 13  9 16 20 21 17) ( 8 12 16) simpleGrading (1 1 1)
    hex ( 9 13 14 10 17 21 22 18) ( 8 12 16) simpleGrading (1 1 1)
    hex (10 14 15 11 18 22 23 19) ( 8 12 16) simpleGrading (1 1 1)
    hex (11 15 12  8 19 23 20 16) ( 8 12 16) simpleGrading (1 1 1)

    hex (12 15 14 13 20 23 22 21) (12 12 16) simpleGrading (1 1 1)

    hex (16 20 21 17 24 28 29 25) ( 8 12 16) simpleGrading (1 1 1)
    hex (17 21 22 18 25 29 30 26) ( 8 12 16) simpleGrading (1 1 1)
    hex (18 22 23 19 26 30 31 27) ( 8 12 16) simpleGrading (1 1 1)
    hex (19 23 20 16 27 31 28 24) ( 8 12 16) simpleGrading (1 1 1)

    hex (20 23 22 21 28 31 30 29) (12 12 16) simpleGrading (1 1 1)
);

edges
(
    arc  0  1 90 (-1 0 0)
    arc  1  2 90 (-1 0 0)
    arc  2  3 90 (-1 0 0)
    arc  3  0 90 (-1 0 0)

    arc  8  9 90 (-1 0 0)
    arc  9 10 90 (-1 0 0)
    arc 10 11 90 (-1 0 0)
    arc 11  8 90 (-1 0 0)

    arc 16 17 90 (-1 0 0)
    arc 17 18 90 (-1 0 0)
    arc 18 19 90 (-1 0 0)
    arc 19 16 90 (-1 0 0)

    arc 24 25 90 (-1 0 0)
    arc 25 26 90 (-1 0 0)
    arc 26 27 90 (-1 0 0)
    arc 27 24 90 (-1 0 0)
);

defaultPatch
{
    name    walls;
    type    wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  4  5  1)
            ( 1  5  6  2)
            ( 2  6  7  3)
            ( 3  7  4  0)
            ( 4  7  6  5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
            (27 31 28 24)
            (28 31 30 29)
        );
    }
);

// ************************************************************************* //
